app/views/cp_score_sheet_configs/_form.html.erb

    <div class="controls">
      <%= f.select :press_id, CpPress.all.collect{|press|[press.press_name, press.id]}.prepend(["select press",-1]),{} %>
---
SELECT "cp_presses".* FROM "cp_presses"

    <div class="controls">
      <%= f.select :press_run_id, CpPressRun.all.collect{|press_run|[press_run.cprun_name,press_run.id]}.prepend(['Select press run',-1]),{} %>
---
SELECT "cp_press_runs".* FROM "cp_press_runs"

    <div class="controls">
      <%= f.select :pic_id, Cppic.all.collect{|pic|[pic.full_name,pic.id]}.prepend(['Select pic', -1]),{} %>
---
SELECT "cppics".* FROM "cppics"