app/views/defect_causes/_form.html.erb

SELECT "score_criteria".* FROM "score_criteria"
---
    <div class="controls">
      <%= f.select :score_criterium_id,ScoreCriterium.all.collect{|score_criteria| [score_criteria.score_criteria,score_criteria.id]}.prepend(["Select score criteria", -1]),{} %>