app/controllers/cp_press_runs_controller.rb

SELECT "cp_press_runs".* FROM "cp_press_runs"
---
  def index
    @cp_press_runs = CpPressRun.all

SELECT "cp_press_runs".* FROM "cp_press_runs" WHERE "cp_press_runs"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @cp_press_run = CpPressRun.find(params[:id])

SELECT "cp_press_runs".* FROM "cp_press_runs" WHERE "cp_press_runs"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @cp_press_run = CpPressRun.find(params[:id])

INSERT INTO "cp_press_runs" ("cprun_name", "created_at", "product_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cprun_name", "Early Run"], ["created_at", Tue, 11 Mar 2014 07:14:29 UTC +00:00], ["product_id", 1], ["updated_at", Tue, 11 Mar 2014 07:14:29 UTC +00:00]]
---
  def create
    @cp_press_run = CpPressRun.new(params[:cp_press_run])

    respond_to do |format|
      if @cp_press_run.save