app/controllers/cp_presses_controller.rb

SELECT "cp_presses".* FROM "cp_presses"
---
  def index
    @cp_presses = CpPress.all

SELECT "cp_presses".* FROM "cp_presses" WHERE "cp_presses"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @cp_press = CpPress.find(params[:id])

SELECT "cp_presses".* FROM "cp_presses" WHERE "cp_presses"."id" = $1 LIMIT 1  [["id", "8"]]
---
  def edit
    @cp_press = CpPress.find(params[:id])

INSERT INTO "cp_presses" ("active", "created_at", "description", "press_name", "timezone_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @cp_press = CpPress.new(params[:cp_press])

    respond_to do |format|
      if @cp_press.save

SELECT "cp_presses".* FROM "cp_presses" WHERE "cp_presses"."id" = $1 LIMIT 1  [["id", "8"]]
UPDATE "cp_presses" SET "press_name" = 'Press 43: First Good', "description" = 'Press 43: First Good', "updated_at" = '2014-03-11 06:34:28.406155' WHERE "cp_presses"."id" = 8
---
  def update
    @cp_press = CpPress.find(params[:id])

    respond_to do |format|
      if @cp_press.update_attributes(params[:cp_press])