app/controllers/cp_score_sheet_configs_controller.rb

SELECT "cp_score_sheet_configs".* FROM "cp_score_sheet_configs"
---
  def index
    @cp_score_sheet_configs = CpScoreSheetConfig.all

SELECT "cp_score_sheet_configs".* FROM "cp_score_sheet_configs" WHERE "cp_score_sheet_configs"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @cp_score_sheet_config = CpScoreSheetConfig.find(params[:id])

SELECT "cp_score_sheet_configs".* FROM "cp_score_sheet_configs" WHERE "cp_score_sheet_configs"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @cp_score_sheet_config = CpScoreSheetConfig.find(params[:id])

INSERT INTO "cp_score_sheet_configs" ("bw_page_rated", "color_page_rated", "created_at", "foreman_id", "issue_date", "pic_id", "press_id", "press_run_id", "product_id", "total_section", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @cp_score_sheet_config = CpScoreSheetConfig.new(params[:cp_score_sheet_config])

    respond_to do |format|
      if @cp_score_sheet_config.save