app/controllers/cppics_controller.rb

  def index
    @cppics = Cppic.all
---
SELECT "cppics".* FROM "cppics"

  def show
    @cppic = Cppic.find(params[:id])
---
SELECT "cppics".* FROM "cppics" WHERE "cppics"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @cppic = Cppic.new(params[:cppic])

    respond_to do |format|
      if @cppic.save
---
INSERT INTO "cppics" ("cell", "created_at", "email", "first_name", "last_name", "phone", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"