app/controllers/defect_causes_controller.rb

INSERT INTO "defect_causes" ("created_at", "defect_cause", "points", "score_criterium_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @defect_cause = DefectCause.new(params[:defect_cause])

    respond_to do |format|
      if @defect_cause.save

UPDATE "defect_causes" SET "points" = 4.0, "updated_at" = '2014-03-27 12:30:56.789149' WHERE "defect_causes"."id" = 15
---
  def update
    @defect_cause = DefectCause.find(params[:id])

    respond_to do |format|
      if @defect_cause.update_attributes(params[:defect_cause])