app/controllers/page_types_controller.rb

SELECT "page_types".* FROM "page_types"
---
  def index
    @page_types = PageType.all

SELECT "page_types".* FROM "page_types" WHERE "page_types"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @page_type = PageType.find(params[:id])

INSERT INTO "page_types" ("created_at", "number_of_page", "page_type", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 26 Mar 2014 08:11:44 UTC +00:00], ["number_of_page", 8], ["page_type", "Color Pages"], ["updated_at", Wed, 26 Mar 2014 08:11:44 UTC +00:00]]
---
  def create
    @page_type = PageType.new(params[:page_type])

    respond_to do |format|
      if @page_type.save