app/views/page_type_score_criteria/_form.html.erb

    <div class="controls">
      <%= f.select :page_type_id, PageType.all.collect{|page_type|[page_type.page_type,page_type.id]}.prepend(["Select page type",-1]),{}%>
---
SELECT "page_types".* FROM "page_types"

    <div class="controls">
      <%= f.select :score_criterium_id, ScoreCriterium.all.collect{|score_criteria| [score_criteria.score_criteria,score_criteria.id]}.prepend(["Select score criteria", -1]),{}%>
---
SELECT "score_criteria".* FROM "score_criteria"