app/views/cp_press_runs/_dl_press_run.html.erb

  <div class="controls">
    <%= f.select :product_id, Product.all.collect{|product| [product.product_name,product.id] }.prepend(["Select product",-1]), {} %>
---
SELECT "products".* FROM "products"